from math import *
# V - объем
# P - кол-во пикселей
# бит
# байт 8 2 ** 3 бит
# килобайт 1024, 2 ** 10 байт
# мегабайт 1024, 2 ** 10
# гигабайт 1024, 2 ** 10
# терабайт 1024, 2 ** 10


# 0
# P = 312 * 2048
# V = 390 * 2 ** 13
# i = V / P
# N = 2 ** i
# print(N)

# 1
# P = 512 * 8192
# V = 6 * 2 ** 23
# i = V / P
# print(i)

# N = 2 ** i
# i = log2(N)

# 2
# P = 512 * 2561
# N = 8192
# i = log2(N)
# V = P * i
# print(V / 2 ** 13)

# 3
# P = 1024 * 3072
# V = 3563 * 2 ** 13
# i = V / P
# N = 2 ** i
# print(N)

# S = V / t
# t = v / s
# V = t * s


# 4)
# P1 = 1280 * 3750
# V1 = P1 * 16
# t1 = V1 / 12800000
#
# P2 = 1200 * 800
# i2 = log2(4096)
# V2 = P2 * i2
# t2 = V2 / 320000
#
# print(t2 - t1)

# 5)
# P1 = 1920 * 1080
# V1 = P1 * 32
#
# P2 = 1280 * 1024
# V2 = P2 * 30
#
# print(((V1 - V2) / (2 ** 13) * 120))

# 6
# P1 = 2560 * 1440
# V1 = P1 * 30
# P2 = 1920 * 1080
# V2 = P2 * 28
# print(((V1 - V2) // (2 ** 13) * 130))


# 7
# P1 = 3840 * 2160
# V1 = P1 * 17
# P2 = 1280 * 720
# V2 = P2 * 5
# print(((V1 - V2) / (2 ** 13)) * 120)

# 8
# P = 3440 * 2880
# V = P * log2(4096)
# print(V / 2 ** 23)

# 9)
# P = 3840 * 2160
# i = 24
# V = P * i
# K = 16 * 2 ** 33
# V3742 = V * 3742
# Kol_vo_kart = V3742 / K
# Kol = K // V
# print(3742 - (Kol * 5))
# print(Kol)

# 10
# P = 1920 * 1080
# V = 5111000 * 100
# V1 = V / 50
# i = V1 // P
# print(i)